Application/backend/controllers/AdminController.php

SELECT * FROM `admin` WHERE `id`='5'
---
    protected function findModel($id)
    {
        if (($model = Admin::findOne($id)) !== null) {