Application/backend/controllers/EventController.php

SELECT * FROM `event`
---
    public function actionIndex()
    {
       $events = Event::find()->all();