Application/backend/controllers/WeatherstationController.php

SELECT * FROM `weatherstation` WHERE `id`='2'
---
    protected function findModel($id)
    {
        if (($model = Weatherstation::findOne($id)) !== null) {