Application/advanced/frontend/models/SignupForm.php

    public function signup()
    {
        if (!$this->validate()) {
            return null;
        }

        $user = new User();
        $user->firstName = $this->firstName;
        $user->lastName = $this->lastName;
        $user->MiddleName = $this->MiddleName;
        $user->Age = $this->Age;
        $user->Birth = $this->Birth;
        $user->Address = $this->Address;
        $user->YearsInCompany = $this->YearsInCompany;
        $user->Department = $this->Department;
        $user->username = $this->username;
        $user->email = $this->email;
        $user->setPassword($this->password);
        $user->generateAuthKey();

        return $user->save() ? $user : null;
---
INSERT INTO `user` (`firstName`, `lastName`, `MiddleName`, `Age`, `Birth`, `Address`, `YearsInCompany`, `Department`, `Employee_ID`, `username`, `email`, `password_hash`, `auth_key`, `status`, `created_at`, `updated_at`) VALUES ('Adrian', 'Tobias', 'De Vera', NULL, NULL, NULL, NULL, NULL, '2014-100697', 'cooladrian', 'adriantobias94@gmail.com', '$2y$13$EunMOuc8BMcebRiyAvbYceRB8e5lJhaOKAi4WZe44Vr6KSPWbSetK', 'K8eQO7ArGEoa64vuTCCT31Ga6LTQ1lsJ', 10, 1470572034, 1470572034)