Application/frontend/controllers/ServicereportController.php

SELECT * FROM `servicereport` WHERE `id`='1'
---
    protected function findModel($id)
    {
        if (($model = Servicereport::findOne($id)) !== null) {