Application/frontend/controllers/WeatherstationController.php

INSERT INTO `weatherstation` (`WeatherStation_Model`, `WeatherStation_Name`, `WeatherStation_Location`, `WeatherStation_Status`, `WeatherStation_Gateway`, `WeatherStation_Logger`, `WeatherStation_Number`) VALUES ('ISEET', '200391830', 'Makati, Metro Manila', 'On', 'GLOBE', 'LUFFTWATFE', '09134562154')
---
    public function actionCreate()
    {
        $model = new Weatherstation();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {